## ✅ Terraform Plan successful
#### Terraform Plan Output
<details>
<summary>Show Output</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_lambda_event_source_mapping.orchestrator_sqs_trigger will be created
  + resource "aws_lambda_event_source_mapping" "orchestrator_sqs_trigger" {
      + arn                           = (known after apply)
      + batch_size                    = 5
      + enabled                       = true
      + event_source_arn              = "arn:aws:sqs:us-east-1:886360753244:data-processed-queue"
      + function_arn                  = (known after apply)
      + function_name                 = "arn:aws:lambda:us-east-1:886360753244:function:aws-java-orchestrator"
      + id                            = (known after apply)
      + last_modified                 = (known after apply)
      + last_processing_result        = (known after apply)
      + maximum_record_age_in_seconds = (known after apply)
      + maximum_retry_attempts        = (known after apply)
      + parallelization_factor        = (known after apply)
      + region                        = "us-east-1"
      + state                         = (known after apply)
      + state_transition_reason       = (known after apply)
      + tags_all                      = (known after apply)
      + uuid                          = (known after apply)

      + amazon_managed_kafka_event_source_config (known after apply)

      + self_managed_kafka_event_source_config (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>